cases/square2D_multiprocessing/env03/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "30";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
23125
(
(2.0002393 -0.0003133001 0)
(2.0002307 -0.00089459437 0)
(2.0002135 -0.0013818672 0)
(2.0001871 -0.0017705065 0)
(2.0001517 -0.0020601368 0)
(2.0001088 -0.0022553144 0)
(2.0000606 -0.0023654059 0)
(2.0000039 -0.0024022298 0)
...
)
;

boundaryField
{
    IN
    {
        type            fixedValue;
        value           uniform (2 0 0);
    }
    OUT
    {
        type            zeroGradient;
    }
    SYM
    {
        type            symmetry;
    }
    RECT
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    JET3
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    JET8
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    JET1
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    JET2
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    JET4
    {
        type            incrementalJetUniVelocity;
        v0              (0 0 0);
        v1              (0 0 0);
        alpha           0.2;
        t0              0;
        deltaT          0.0005;
        value           uniform (0 0 0);
    }
    JET5
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    JET6
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    JET7
    {
        type            incrementalJetUniVelocity;
        v0              (0 0 0);
        v1              (0 0 0);
        alpha           0.2;
        t0              0;
        deltaT          0.0005;
        value           uniform (0 0 0);
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
