cases/square2D_multiprocessing/env03/system/probes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

fields (p U);
probeLocations
(
    (-0.029166667 0.0375 0)
    (-0.020833333 0.0375 0)
    (-0.0125 0.0375 0)
    (-0.004166667 0.0375 0)
    (0.004166667 0.0375 0)
    (0.0125 0.0375 0)
    (0.020833333 0.0375 0)
    (0.029166666 0.0375 0)
    (0.0375 0.0375 0)
    (-0.0375 -0.0375 0)
    (-0.029166667 -0.0375 0)
    (-0.020833333 -0.0375 0)
    (-0.0125 -0.0375 0)
    (-0.004166667 -0.0375 0)
    (0.004166667 -0.0375 0)
    (0.0125 -0.0375 0)
    (0.020833333 -0.0375 0)
    (0.029166666 -0.0375 0)
    (0.0375 -0.0375 0)
    (-0.0375 0.0375 0)
    (-0.0375 0.029166667 0)
    (-0.0375 0.020833334 0)
    (-0.0375 0.012500001 0)
    (-0.0375 0.004166668 0)
    (-0.0375 -0.004166665 0)
    (-0.0375 -0.012499998 0)
    (-0.0375 -0.020833331 0)
    (-0.0375 -0.029166664 0)
    (0.0375 0.029166667 0)
    (0.0375 0.020833334 0)
    (0.0375 0.012500001 0)
    (0.0375 0.004166668 0)
    (0.0375 -0.004166665 0)
    (0.0375 -0.012499998 0)
    (0.0375 -0.020833331 0)
    (0.0375 -0.029166664 0)
    (-0.05 0.05 0)
    (-0.038888889 0.05 0)
    (-0.027777778 0.05 0)
    (-0.016666667 0.05 0)
    (-0.005555556 0.05 0)
    (0.005555555 0.05 0)
    (0.016666666 0.05 0)
    (0.027777777 0.05 0)
    (0.038888888 0.05 0)
    (0.049999999 0.05 0)
    (-0.05 -0.05 0)
    (-0.038888889 -0.05 0)
    (-0.027777778 -0.05 0)
    (-0.016666667 -0.05 0)
    (-0.005555556 -0.05 0)
    (0.005555555 -0.05 0)
    (0.016666666 -0.05 0)
    (0.027777777 -0.05	0)
    (0.038888888 -0.05	0)
    (0.049999999 -0.05	0)
    (0.049999999 -0.038888889 0)
    (0.049999999 -0.027777778 0)
    (0.049999999 -0.016666667 0)
    (0.049999999 -0.005555556 0)
    (0.049999999 0.005555555 0)
    (0.049999999 0.016666666 0)
    (0.049999999 0.027777777 0)
    (0.049999999 0.038888888 0)
    (-0.05 -0.038888889 0)
    (-0.05 -0.027777778 0)
    (-0.05 -0.016666667 0)
    (-0.05 -0.005555556 0)
    (-0.05 0.005555555	0)
    (-0.05 0.016666666	0)
    (-0.05 0.027777777	0)
    (-0.05 0.038888888	0)
    (-0.0125 0.075 0)
    (0 0.075 0)
    (0.0125 0.075 0)
    (0.025 0.075 0)
    (0.0375 0.075 0)
    (0.05 0.075 0)
    (0.075 0.075 0)
    (0.1 0.075 0)
    (0.125 0.075 0)
    (0.15 0.075 0)
    (0.175 0.075 0)
    (0.2 0.075 0)
    (0.225 0.075 0)
    (-0.0125 0.05 0)
    (0 0.05 0)
    (0.0125 0.05 0)
    (0.025 0.05 0)
    (0.0375  0.05 0)
    (0.05 0.05 0)
    (0.075 0.05 0)
    (0.1 0.05 0)
    (0.125 0.05 0)
    (0.15 0.05 0)
    (0.175 0.05 0)
    (0.2 0.05 0)
    (0.225 0.05 0)
    (0.0375 0.025 0)
    (0.05 0.025 0)
    (0.075 0.025 0)
    (0.1 0.025 0)
    (0.125 0.025 0)
    (0.15 0.025 0)
    (0.175 0.025 0)
    (0.2 0.025 0)
    (0.225 0.025 0)
    (0.075 0 0)
    (0.1  0 0)
    (0.125 0 0)
    (0.15 0 0)
    (0.175 0 0)
    (0.2 0 0)
    (0.225 0 0)
    (-0.0125 -0.075 0)
    (0 -0.075 0)
    (0.0125 -0.075 0)
    (0.025 -0.075 0)
    (0.0375 -0.075 0)
    (0.05 -0.075 0)
    (0.075 -0.075 0)
    (0.1 -0.075 0)
    (0.125 -0.075 0)
    (0.15 -0.075 0)
    (0.175 -0.075 0)
    (0.2 -0.075 0)
    (0.225 -0.075  0)
    (-0.0125 -0.05 0)
    (0 -0.05 0)
    (0.0125 -0.05 0)
    (0.025 -0.05 0)
    (0.0375 -0.05 0)
    (0.05 -0.05 0)
    (0.075 -0.05 0)
    (0.1 -0.05 0)
    (0.125 -0.05 0)
    (0.15 -0.05 0)
    (0.175 -0.05 0)
    (0.2 -0.05 0)
    (0.225 -0.05 0)
    (0.0375 -0.025 0)
    (0.05 -0.025 0)
    (0.075 -0.025 0)
    (0.1 -0.025 0)
    (0.125 -0.025 0)
    (0.15 -0.025 0)
    (0.175 -0.025 0)
    (0.2 -0.025 0)
    (0.225 -0.025 0)
);

